Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ256DA206.h
#define _G1PUH_PUH8_POSITION                     0x00000008
#define _G1PUH_PUH8_MASK                         0x00000100
#define _G1PUH_PUH8_LENGTH                       0x00000001

#define _G1PUH_PUH9_POSITION                     0x00000009
#define _G1PUH_PUH9_MASK                         0x00000200
#define _G1PUH_PUH9_LENGTH                       0x00000001

#define _G1PUH_PUH10_POSITION                    0x0000000A
#define _G1PUH_PUH10_MASK                        0x00000400
#define _G1PUH_PUH10_LENGTH                      0x00000001

#define _G1DPADRL_DPADR0_POSITION                0x00000000
#define _G1DPADRL_DPADR0_MASK                    0x00000001
#define _G1DPADRL_DPADR0_LENGTH                  0x00000001

#define _G1DPADRL_DPADR1_POSITION                0x00000001
#define _G1DPADRL_DPADR1_MASK                    0x00000002
#define _G1DPADRL_DPADR1_LENGTH                  0x00000001

#define _G1DPADRL_DPADR2_POSITION                0x00000002
#define _G1DPADRL_DPADR2_MASK                    0x00000004
#define _G1DPADRL_DPADR2_LENGTH                  0x00000001

#define _G1DPADRL_DPADR3_POSITION                0x00000003
#define _G1DPADRL_DPADR3_MASK                    0x00000008
#define _G1DPADRL_DPADR3_LENGTH                  0x00000001

#define _G1DPADRL_DPADR4_POSITION                0x00000004
#define _G1DPADRL_DPADR4_MASK                    0x00000010
#define _G1DPADRL_DPADR4_LENGTH                  0x00000001

#define _G1DPADRL_DPADR5_POSITION                0x00000005
#define _G1DPADRL_DPADR5_MASK                    0x00000020
#define _G1DPADRL_DPADR5_LENGTH                  0x00000001

#define _G1DPADRL_DPADR6_POSITION                0x00000006
#define _G1DPADRL_DPADR6_MASK                    0x00000040
#define _G1DPADRL_DPADR6_LENGTH                  0x00000001

#define _G1DPADRL_DPADR7_POSITION                0x00000007
#define _G1DPADRL_DPADR7_MASK                    0x00000080
#define _G1DPADRL_DPADR7_LENGTH                  0x00000001

#define _G1DPADRL_DPADR8_POSITION                0x00000008
#define _G1DPADRL_DPADR8_MASK                    0x00000100
#define _G1DPADRL_DPADR8_LENGTH                  0x00000001

#define _G1DPADRL_DPADR9_POSITION                0x00000009
#define _G1DPADRL_DPADR9_MASK                    0x00000200
#define _G1DPADRL_DPADR9_LENGTH                  0x00000001

#define _G1DPADRL_DPADR10_POSITION               0x0000000A
#define _G1DPADRL_DPADR10_MASK                   0x00000400
#define _G1DPADRL_DPADR10_LENGTH                 0x00000001

#define _G1DPADRL_DPADR11_POSITION               0x0000000B
#define _G1DPADRL_DPADR11_MASK                   0x00000800
#define _G1DPADRL_DPADR11_LENGTH                 0x00000001

#define _G1DPADRL_DPADR12_POSITION               0x0000000C
#define _G1DPADRL_DPADR12_MASK                   0x00001000
#define _G1DPADRL_DPADR12_LENGTH                 0x00000001

#define _G1DPADRL_DPADR13_POSITION               0x0000000D
#define _G1DPADRL_DPADR13_MASK                   0x00002000
#define _G1DPADRL_DPADR13_LENGTH                 0x00000001

#define _G1DPADRL_DPADR14_POSITION               0x0000000E
#define _G1DPADRL_DPADR14_MASK                   0x00004000
#define _G1DPADRL_DPADR14_LENGTH                 0x00000001

#define _G1DPADRL_DPADR15_POSITION               0x0000000F
#define _G1DPADRL_DPADR15_MASK                   0x00008000
#define _G1DPADRL_DPADR15_LENGTH                 0x00000001

#define _G1DPADRH_DPADR16_POSITION               0x00000000
#define _G1DPADRH_DPADR16_MASK                   0x00000001
#define _G1DPADRH_DPADR16_LENGTH                 0x00000001

#define _G1DPADRH_DPADR17_POSITION               0x00000001
#define _G1DPADRH_DPADR17_MASK                   0x00000002
#define _G1DPADRH_DPADR17_LENGTH                 0x00000001

#define _G1DPADRH_DPADR18_POSITION               0x00000002
#define _G1DPADRH_DPADR18_MASK                   0x00000004
#define _G1DPADRH_DPADR18_LENGTH                 0x00000001

#define _G1DPADRH_DPADR19_POSITION               0x00000003
#define _G1DPADRH_DPADR19_MASK                   0x00000008
#define _G1DPADRH_DPADR19_LENGTH                 0x00000001

#define _G1DPADRH_DPADR20_POSITION               0x00000004
#define _G1DPADRH_DPADR20_MASK                   0x00000010
#define _G1DPADRH_DPADR20_LENGTH                 0x00000001

#define _G1DPADRH_DPADR21_POSITION               0x00000005
#define _G1DPADRH_DPADR21_MASK                   0x00000020
#define _G1DPADRH_DPADR21_LENGTH                 0x00000001

#define _G1DPADRH_DPADR22_POSITION               0x00000006
#define _G1DPADRH_DPADR22_MASK                   0x00000040
#define _G1DPADRH_DPADR22_LENGTH                 0x00000001

#define _G1DPADRH_DPADR23_POSITION               0x00000007
#define _G1DPADRH_DPADR23_MASK                   0x00000080
#define _G1DPADRH_DPADR23_LENGTH                 0x00000001

#define _G1DPW_DPW_POSITION                      0x00000000
#define _G1DPW_DPW_MASK                          0x000007FF
#define _G1DPW_DPW_LENGTH                        0x0000000B

#define _G1DPW_DPW0_POSITION                     0x00000000
#define _G1DPW_DPW0_MASK                         0x00000001
#define _G1DPW_DPW0_LENGTH                       0x00000001

#define _G1DPW_DPW1_POSITION                     0x00000001
#define _G1DPW_DPW1_MASK                         0x00000002
#define _G1DPW_DPW1_LENGTH                       0x00000001

#define _G1DPW_DPW2_POSITION                     0x00000002
#define _G1DPW_DPW2_MASK                         0x00000004
#define _G1DPW_DPW2_LENGTH                       0x00000001

#define _G1DPW_DPW3_POSITION                     0x00000003
#define _G1DPW_DPW3_MASK                         0x00000008
#define _G1DPW_DPW3_LENGTH                       0x00000001

#define _G1DPW_DPW4_POSITION                     0x00000004
#define _G1DPW_DPW4_MASK                         0x00000010
#define _G1DPW_DPW4_LENGTH                       0x00000001

#define _G1DPW_DPW5_POSITION                     0x00000005
#define _G1DPW_DPW5_MASK                         0x00000020
#define _G1DPW_DPW5_LENGTH                       0x00000001

#define _G1DPW_DPW6_POSITION                     0x00000006
#define _G1DPW_DPW6_MASK                         0x00000040
#define _G1DPW_DPW6_LENGTH                       0x00000001

#define _G1DPW_DPW7_POSITION                     0x00000007
#define _G1DPW_DPW7_MASK                         0x00000080
#define _G1DPW_DPW7_LENGTH                       0x00000001

