Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ256DA206.h
#define _G1CHRX_CURPOSX9_POSITION                0x00000009
#define _G1CHRX_CURPOSX9_MASK                    0x00000200
#define _G1CHRX_CURPOSX9_LENGTH                  0x00000001

#define _G1CHRX_CURPOSX10_POSITION               0x0000000A
#define _G1CHRX_CURPOSX10_MASK                   0x00000400
#define _G1CHRX_CURPOSX10_LENGTH                 0x00000001

#define _G1CHRY_CURPOSY_POSITION                 0x00000000
#define _G1CHRY_CURPOSY_MASK                     0x000007FF
#define _G1CHRY_CURPOSY_LENGTH                   0x0000000B

#define _G1CHRY_CURPOSY0_POSITION                0x00000000
#define _G1CHRY_CURPOSY0_MASK                    0x00000001
#define _G1CHRY_CURPOSY0_LENGTH                  0x00000001

#define _G1CHRY_CURPOSY1_POSITION                0x00000001
#define _G1CHRY_CURPOSY1_MASK                    0x00000002
#define _G1CHRY_CURPOSY1_LENGTH                  0x00000001

#define _G1CHRY_CURPOSY2_POSITION                0x00000002
#define _G1CHRY_CURPOSY2_MASK                    0x00000004
#define _G1CHRY_CURPOSY2_LENGTH                  0x00000001

#define _G1CHRY_CURPOSY3_POSITION                0x00000003
#define _G1CHRY_CURPOSY3_MASK                    0x00000008
#define _G1CHRY_CURPOSY3_LENGTH                  0x00000001

#define _G1CHRY_CURPOSY4_POSITION                0x00000004
#define _G1CHRY_CURPOSY4_MASK                    0x00000010
#define _G1CHRY_CURPOSY4_LENGTH                  0x00000001

#define _G1CHRY_CURPOSY5_POSITION                0x00000005
#define _G1CHRY_CURPOSY5_MASK                    0x00000020
#define _G1CHRY_CURPOSY5_LENGTH                  0x00000001

#define _G1CHRY_CURPOSY6_POSITION                0x00000006
#define _G1CHRY_CURPOSY6_MASK                    0x00000040
#define _G1CHRY_CURPOSY6_LENGTH                  0x00000001

#define _G1CHRY_CURPOSY7_POSITION                0x00000007
#define _G1CHRY_CURPOSY7_MASK                    0x00000080
#define _G1CHRY_CURPOSY7_LENGTH                  0x00000001

#define _G1CHRY_CURPOSY8_POSITION                0x00000008
#define _G1CHRY_CURPOSY8_MASK                    0x00000100
#define _G1CHRY_CURPOSY8_LENGTH                  0x00000001

#define _G1CHRY_CURPOSY9_POSITION                0x00000009
#define _G1CHRY_CURPOSY9_MASK                    0x00000200
#define _G1CHRY_CURPOSY9_LENGTH                  0x00000001

#define _G1CHRY_CURPOSY10_POSITION               0x0000000A
#define _G1CHRY_CURPOSY10_MASK                   0x00000400
#define _G1CHRY_CURPOSY10_LENGTH                 0x00000001

#define _G1IPU_BFINAL_POSITION                   0x00000000
#define _G1IPU_BFINAL_MASK                       0x00000001
#define _G1IPU_BFINAL_LENGTH                     0x00000001

#define _G1IPU_IPUDONE_POSITION                  0x00000001
#define _G1IPU_IPUDONE_MASK                      0x00000002
#define _G1IPU_IPUDONE_LENGTH                    0x00000001

#define _G1IPU_WRAPERR_POSITION                  0x00000002
#define _G1IPU_WRAPERR_MASK                      0x00000004
#define _G1IPU_WRAPERR_LENGTH                    0x00000001

#define _G1IPU_LENERR_POSITION                   0x00000003
#define _G1IPU_LENERR_MASK                       0x00000008
#define _G1IPU_LENERR_LENGTH                     0x00000001

#define _G1IPU_BLCKERR_POSITION                  0x00000004
#define _G1IPU_BLCKERR_MASK                      0x00000010
#define _G1IPU_BLCKERR_LENGTH                    0x00000001

#define _G1IPU_HUFFERR_POSITION                  0x00000005
#define _G1IPU_HUFFERR_MASK                      0x00000020
#define _G1IPU_HUFFERR_LENGTH                    0x00000001

#define _G1DBEN_GDBEN_POSITION                   0x00000000
#define _G1DBEN_GDBEN_MASK                       0x0000FFFF
#define _G1DBEN_GDBEN_LENGTH                     0x00000010

#define _G1DBEN_GDBEN0_POSITION                  0x00000000
#define _G1DBEN_GDBEN0_MASK                      0x00000001
#define _G1DBEN_GDBEN0_LENGTH                    0x00000001

#define _G1DBEN_GDBEN1_POSITION                  0x00000001
#define _G1DBEN_GDBEN1_MASK                      0x00000002
#define _G1DBEN_GDBEN1_LENGTH                    0x00000001

#define _G1DBEN_GDBEN2_POSITION                  0x00000002
#define _G1DBEN_GDBEN2_MASK                      0x00000004
#define _G1DBEN_GDBEN2_LENGTH                    0x00000001

#define _G1DBEN_GDBEN3_POSITION                  0x00000003
#define _G1DBEN_GDBEN3_MASK                      0x00000008
#define _G1DBEN_GDBEN3_LENGTH                    0x00000001

#define _G1DBEN_GDBEN4_POSITION                  0x00000004
#define _G1DBEN_GDBEN4_MASK                      0x00000010
#define _G1DBEN_GDBEN4_LENGTH                    0x00000001

#define _G1DBEN_GDBEN5_POSITION                  0x00000005
#define _G1DBEN_GDBEN5_MASK                      0x00000020
#define _G1DBEN_GDBEN5_LENGTH                    0x00000001

#define _G1DBEN_GDBEN6_POSITION                  0x00000006
#define _G1DBEN_GDBEN6_MASK                      0x00000040
#define _G1DBEN_GDBEN6_LENGTH                    0x00000001

#define _G1DBEN_GDBEN7_POSITION                  0x00000007
#define _G1DBEN_GDBEN7_MASK                      0x00000080
#define _G1DBEN_GDBEN7_LENGTH                    0x00000001

#define _G1DBEN_GDBEN8_POSITION                  0x00000008
#define _G1DBEN_GDBEN8_MASK                      0x00000100
#define _G1DBEN_GDBEN8_LENGTH                    0x00000001

#define _G1DBEN_GDBEN9_POSITION                  0x00000009
#define _G1DBEN_GDBEN9_MASK                      0x00000200
#define _G1DBEN_GDBEN9_LENGTH                    0x00000001

#define _G1DBEN_GDBEN10_POSITION                 0x0000000A
#define _G1DBEN_GDBEN10_MASK                     0x00000400
#define _G1DBEN_GDBEN10_LENGTH                   0x00000001

#define _G1DBEN_GDBEN11_POSITION                 0x0000000B
#define _G1DBEN_GDBEN11_MASK                     0x00000800
#define _G1DBEN_GDBEN11_LENGTH                   0x00000001

#define _G1DBEN_GDBEN12_POSITION                 0x0000000C
#define _G1DBEN_GDBEN12_MASK                     0x00001000
#define _G1DBEN_GDBEN12_LENGTH                   0x00000001

#define _G1DBEN_GDBEN13_POSITION                 0x0000000D
#define _G1DBEN_GDBEN13_MASK                     0x00002000
#define _G1DBEN_GDBEN13_LENGTH                   0x00000001

